In [30]:
import pandas as pd
import numpy as np

* (1) sum(), cumsum() methods 계산 시 : NaN은 '0'으로 처리
* (2) mean(), std() 연산 시 : NaN은 분석 대상(population)에서 제외
* (3) DataFrame 칼럼 간 연산 시 : NaN이 하나라도 있으면 NaN 반환
* (4) DataFrame 간 연산 : 동일한 칼럼끼리는 NaN을 '0'으로 처리하여 연산,

# dropna

In [12]:
df = pd.DataFrame({"name": ['Alfred', 'Batman', 'Catwoman'],
                   "toy": [np.nan, 'Batmobile', 'Bullwhip'],
                   "born": [pd.NaT, pd.Timestamp("1940-04-25"),
                                pd.NaT]})
df

       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

In [13]:
df.dropna()

     name        toy       born
1  Batman  Batmobile 1940-04-25

In [15]:
df.dropna(axis='columns')

       name
0    Alfred
1    Batman
2  Catwoman

In [16]:
df.dropna(how='all') #how = any : nan이 존재하는 어떠한 axis던지 삭제
                     #how = all : 모든 값이 nan이어야 삭제

       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

In [17]:
df.dropna(thresh=2) #남은 값이 2개보다 적을 경우 삭제

       name        toy       born
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

In [18]:
df.dropna(subset=['name', 'born'])

     name        toy       born
1  Batman  Batmobile 1940-04-25

In [29]:
df.dropna(inplace=True) #결과값을 저장할 것인가
df

Empty DataFrame
Columns: [A, B, C, D]
Index: []

# fillna

In [22]:
df = pd.DataFrame([[np.nan, 2, np.nan, 0],
                   [3, 4, np.nan, 1],
                   [np.nan, np.nan, np.nan, 5],
                   [np.nan, 3, np.nan, 4]],
                  columns=list('ABCD'))
df

     A    B   C  D
0  NaN  2.0 NaN  0
1  3.0  4.0 NaN  1
2  NaN  NaN NaN  5
3  NaN  3.0 NaN  4

In [23]:
df.fillna(0)

     A    B    C  D
0  0.0  2.0  0.0  0
1  3.0  4.0  0.0  1
2  0.0  0.0  0.0  5
3  0.0  3.0  0.0  4

In [24]:
df.fillna(method='ffill') #위의 값으로 채움

     A    B   C  D
0  NaN  2.0 NaN  0
1  3.0  4.0 NaN  1
2  3.0  4.0 NaN  5
3  3.0  3.0 NaN  4

In [25]:
values = {'A': 0, 'B': 1, 'C': 2, 'D': 3}
df.fillna(value=values) #지정된 값으로 채우기

     A    B    C  D
0  0.0  2.0  2.0  0
1  3.0  4.0  2.0  1
2  0.0  1.0  2.0  5
3  0.0  3.0  2.0  4

In [27]:
values = {'A': 0, 'B': 1, 'C': 2, 'D': 3}
df.fillna(value=values, limit=1)

     A    B    C  D
0  0.0  2.0  2.0  0
1  3.0  4.0  NaN  1
2  NaN  1.0  NaN  5
3  NaN  3.0  NaN  4